MikroElektronika/core_packages/PIC/XC8/def/PIC18F86J16/mcu.h
// Register: PORTD
#define PORTD PORTD
extern volatile unsigned char           PORTD               __at(0xF83);
#ifndef _LIB_BUILD
asm("PORTD equ 0F83h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RD0                    :1;
        unsigned RD1                    :1;
        unsigned RD2                    :1;
        unsigned RD3                    :1;
        unsigned RD4                    :1;
        unsigned RD5                    :1;
        unsigned RD6                    :1;
        unsigned RD7                    :1;
    };
    struct {
        unsigned PMD0                   :1;
        unsigned PMD1                   :1;
        unsigned PMD2                   :1;
        unsigned PMD3                   :1;
        unsigned PMD4                   :1;
        unsigned PMD5                   :1;
        unsigned PMD6                   :1;
        unsigned PMD7                   :1;
    };
    struct {
        unsigned AD0                    :1;
        unsigned AD1                    :1;
        unsigned AD2                    :1;
        unsigned AD3                    :1;
        unsigned AD4                    :1;
        unsigned AD5                    :1;
        unsigned AD6                    :1;
        unsigned AD7                    :1;
    };
    struct {
        unsigned                        :5;
        unsigned SDA2                   :1;
        unsigned SCL2                   :1;
        unsigned SS2                    :1;
    };
    struct {
        unsigned                        :4;
        unsigned SDO2                   :1;
        unsigned SDI2                   :1;
        unsigned SCK2                   :1;
    };
} PORTDbits_t;
extern volatile PORTDbits_t PORTDbits __at(0xF83);
// bitfield macros
#define _PORTD_RD0_POSN                                     0x0
#define _PORTD_RD0_POSITION                                 0x0
#define _PORTD_RD0_SIZE                                     0x1
#define _PORTD_RD0_LENGTH                                   0x1
#define _PORTD_RD0_MASK                                     0x1
#define _PORTD_RD1_POSN                                     0x1
#define _PORTD_RD1_POSITION                                 0x1
#define _PORTD_RD1_SIZE                                     0x1
#define _PORTD_RD1_LENGTH                                   0x1
#define _PORTD_RD1_MASK                                     0x2
#define _PORTD_RD2_POSN                                     0x2
#define _PORTD_RD2_POSITION                                 0x2
#define _PORTD_RD2_SIZE                                     0x1
#define _PORTD_RD2_LENGTH                                   0x1
#define _PORTD_RD2_MASK                                     0x4
#define _PORTD_RD3_POSN                                     0x3
#define _PORTD_RD3_POSITION                                 0x3
#define _PORTD_RD3_SIZE                                     0x1
#define _PORTD_RD3_LENGTH                                   0x1
#define _PORTD_RD3_MASK                                     0x8
#define _PORTD_RD4_POSN                                     0x4
#define _PORTD_RD4_POSITION                                 0x4
#define _PORTD_RD4_SIZE                                     0x1
#define _PORTD_RD4_LENGTH                                   0x1
#define _PORTD_RD4_MASK                                     0x10
#define _PORTD_RD5_POSN                                     0x5
#define _PORTD_RD5_POSITION                                 0x5
#define _PORTD_RD5_SIZE                                     0x1
#define _PORTD_RD5_LENGTH                                   0x1
#define _PORTD_RD5_MASK                                     0x20
#define _PORTD_RD6_POSN                                     0x6
#define _PORTD_RD6_POSITION                                 0x6
#define _PORTD_RD6_SIZE                                     0x1
#define _PORTD_RD6_LENGTH                                   0x1
#define _PORTD_RD6_MASK                                     0x40
#define _PORTD_RD7_POSN                                     0x7
#define _PORTD_RD7_POSITION                                 0x7
#define _PORTD_RD7_SIZE                                     0x1
#define _PORTD_RD7_LENGTH                                   0x1
#define _PORTD_RD7_MASK                                     0x80
#define _PORTD_PMD0_POSN                                    0x0
#define _PORTD_PMD0_POSITION                                0x0
#define _PORTD_PMD0_SIZE                                    0x1
#define _PORTD_PMD0_LENGTH                                  0x1
#define _PORTD_PMD0_MASK                                    0x1
#define _PORTD_PMD1_POSN                                    0x1
#define _PORTD_PMD1_POSITION                                0x1
#define _PORTD_PMD1_SIZE                                    0x1
#define _PORTD_PMD1_LENGTH                                  0x1
#define _PORTD_PMD1_MASK                                    0x2
#define _PORTD_PMD2_POSN                                    0x2
#define _PORTD_PMD2_POSITION                                0x2
#define _PORTD_PMD2_SIZE                                    0x1
#define _PORTD_PMD2_LENGTH                                  0x1
#define _PORTD_PMD2_MASK                                    0x4
#define _PORTD_PMD3_POSN                                    0x3
#define _PORTD_PMD3_POSITION                                0x3
#define _PORTD_PMD3_SIZE                                    0x1
#define _PORTD_PMD3_LENGTH                                  0x1
#define _PORTD_PMD3_MASK                                    0x8
#define _PORTD_PMD4_POSN                                    0x4
#define _PORTD_PMD4_POSITION                                0x4
#define _PORTD_PMD4_SIZE                                    0x1
#define _PORTD_PMD4_LENGTH                                  0x1
#define _PORTD_PMD4_MASK                                    0x10
#define _PORTD_PMD5_POSN                                    0x5
#define _PORTD_PMD5_POSITION                                0x5
#define _PORTD_PMD5_SIZE                                    0x1
#define _PORTD_PMD5_LENGTH                                  0x1
#define _PORTD_PMD5_MASK                                    0x20
#define _PORTD_PMD6_POSN                                    0x6
#define _PORTD_PMD6_POSITION                                0x6
#define _PORTD_PMD6_SIZE                                    0x1
#define _PORTD_PMD6_LENGTH                                  0x1
#define _PORTD_PMD6_MASK                                    0x40
#define _PORTD_PMD7_POSN                                    0x7
#define _PORTD_PMD7_POSITION                                0x7
#define _PORTD_PMD7_SIZE                                    0x1
#define _PORTD_PMD7_LENGTH                                  0x1
#define _PORTD_PMD7_MASK                                    0x80
#define _PORTD_AD0_POSN                                     0x0
#define _PORTD_AD0_POSITION                                 0x0
#define _PORTD_AD0_SIZE                                     0x1
#define _PORTD_AD0_LENGTH                                   0x1
#define _PORTD_AD0_MASK                                     0x1
#define _PORTD_AD1_POSN                                     0x1
#define _PORTD_AD1_POSITION                                 0x1
#define _PORTD_AD1_SIZE                                     0x1
#define _PORTD_AD1_LENGTH                                   0x1
#define _PORTD_AD1_MASK                                     0x2
#define _PORTD_AD2_POSN                                     0x2
#define _PORTD_AD2_POSITION                                 0x2
#define _PORTD_AD2_SIZE                                     0x1
#define _PORTD_AD2_LENGTH                                   0x1
#define _PORTD_AD2_MASK                                     0x4
#define _PORTD_AD3_POSN                                     0x3
#define _PORTD_AD3_POSITION                                 0x3
#define _PORTD_AD3_SIZE                                     0x1
#define _PORTD_AD3_LENGTH                                   0x1
#define _PORTD_AD3_MASK                                     0x8
#define _PORTD_AD4_POSN                                     0x4
#define _PORTD_AD4_POSITION                                 0x4
#define _PORTD_AD4_SIZE                                     0x1
#define _PORTD_AD4_LENGTH                                   0x1
#define _PORTD_AD4_MASK                                     0x10
#define _PORTD_AD5_POSN                                     0x5
#define _PORTD_AD5_POSITION                                 0x5
#define _PORTD_AD5_SIZE                                     0x1
#define _PORTD_AD5_LENGTH                                   0x1
#define _PORTD_AD5_MASK                                     0x20
#define _PORTD_AD6_POSN                                     0x6
#define _PORTD_AD6_POSITION                                 0x6
#define _PORTD_AD6_SIZE                                     0x1
#define _PORTD_AD6_LENGTH                                   0x1
#define _PORTD_AD6_MASK                                     0x40
#define _PORTD_AD7_POSN                                     0x7
#define _PORTD_AD7_POSITION                                 0x7
#define _PORTD_AD7_SIZE                                     0x1
#define _PORTD_AD7_LENGTH                                   0x1
#define _PORTD_AD7_MASK                                     0x80
#define _PORTD_SDA2_POSN                                    0x5
#define _PORTD_SDA2_POSITION                                0x5
#define _PORTD_SDA2_SIZE                                    0x1
#define _PORTD_SDA2_LENGTH                                  0x1
#define _PORTD_SDA2_MASK                                    0x20
#define _PORTD_SCL2_POSN                                    0x6
#define _PORTD_SCL2_POSITION                                0x6
#define _PORTD_SCL2_SIZE                                    0x1
#define _PORTD_SCL2_LENGTH                                  0x1
#define _PORTD_SCL2_MASK                                    0x40
#define _PORTD_SS2_POSN                                     0x7
#define _PORTD_SS2_POSITION                                 0x7
#define _PORTD_SS2_SIZE                                     0x1
#define _PORTD_SS2_LENGTH                                   0x1
#define _PORTD_SS2_MASK                                     0x80
#define _PORTD_SDO2_POSN                                    0x4
#define _PORTD_SDO2_POSITION                                0x4
#define _PORTD_SDO2_SIZE                                    0x1
#define _PORTD_SDO2_LENGTH                                  0x1
#define _PORTD_SDO2_MASK                                    0x10
#define _PORTD_SDI2_POSN                                    0x5
#define _PORTD_SDI2_POSITION                                0x5
#define _PORTD_SDI2_SIZE                                    0x1
#define _PORTD_SDI2_LENGTH                                  0x1
#define _PORTD_SDI2_MASK                                    0x20
#define _PORTD_SCK2_POSN                                    0x6
#define _PORTD_SCK2_POSITION                                0x6
#define _PORTD_SCK2_SIZE                                    0x1
#define _PORTD_SCK2_LENGTH                                  0x1
#define _PORTD_SCK2_MASK                                    0x40

// Register: PORTE
#define PORTE PORTE
extern volatile unsigned char           PORTE               __at(0xF84);
#ifndef _LIB_BUILD
asm("PORTE equ 0F84h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RE0                    :1;
        unsigned RE1                    :1;
        unsigned RE2                    :1;
        unsigned RE3                    :1;
        unsigned RE4                    :1;
        unsigned RE5                    :1;
        unsigned RE6                    :1;
        unsigned RE7                    :1;
    };
    struct {
        unsigned AD8                    :1;
        unsigned AD9                    :1;
        unsigned AD10                   :1;
        unsigned AD11                   :1;
        unsigned AD12                   :1;
        unsigned AD13                   :1;
        unsigned AD14                   :1;
        unsigned AD15                   :1;
    };
    struct {
        unsigned PMRD                   :1;
        unsigned PMWR                   :1;
        unsigned PMBE                   :1;
        unsigned PMA13                  :1;
        unsigned PMA12                  :1;
        unsigned PMA11                  :1;
        unsigned PMA10                  :1;
        unsigned PMA9                   :1;
    };
    struct {
        unsigned                        :3;
        unsigned REFO                   :1;
        unsigned                        :3;
        unsigned CCP2                   :1;
    };
    struct {
        unsigned PD2                    :1;
        unsigned PC2                    :1;
        unsigned CCP10                  :1;
        unsigned CCP9E                  :1;
        unsigned CCP8E                  :1;
        unsigned CCP7E                  :1;
        unsigned CCP6E                  :1;
        unsigned CCP2E                  :1;
    };
    struct {
        unsigned RDE                    :1;
        unsigned WRE                    :1;
        unsigned CS                     :1;
        unsigned PC3E                   :1;
        unsigned PB3E                   :1;
        unsigned PC1E                   :1;
        unsigned PB1E                   :1;
        unsigned PA2E                   :1;
    };
    struct {
        unsigned                        :2;
        unsigned PB2                    :1;
    };
} PORTEbits_t;
